// Lab_03_1.cpp
// < Пірожак, Олександр >
// Лабораторна робота No 3.1
// Розгалуження, задане формулою: функція однієї змінної. // Варіант 0.21

#include <iostream>
#include <cmath>

using namespace std;
int main() 
{
      
    double x; // вхідний параметр
    double y; // результат обчислення виразу
    double A; // проміжний результат - функціонально стала частина виразу
    double B; // проміжний результат - функціонально змінна частина виразу
 
    cout<<"x =";cin >>x;

    A = 2 + 1.0/ fabs (1+x);

    // спосіб 1: розгалуження в неповній формі

    if (x<1)
    {
        B = sqrt(fabs (cos(x))+13);
    }

    if (x<=5 && x>=1)
    {
        B = 3 + 1.0/tan (4+x/sqrt(2));
    }

    if (x>5)
    {
        B = 8+0.7*x;
    }
    
    y = A - B;
       cout << "1) y = " << y << endl;


       // cпосіб 2: розгалуження в повній формі

    if (x<1)
    {
        B = sqrt(fabs (cos(x))+13);
    }
        else 
             {       
                 if (x<=5 && x>=1)
                    {
                        B = 3 + 1.0/tan (4+x/sqrt(2));
                    }
                        else 
                            {
                                B = 8+0.7*x;
                            }
                    
             } 
              
    y = A - B;
       cout << "2) y = " << y << endl;
    
cin.get();
return 0;

}